<?php

namespace Database\Seeders;

use App\Models\SchoolLaw;
use Illuminate\Database\Seeder;

class SchoolLawSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $laws = [
            [
                'title' => 'الالتزام بعدم الغياب إلا لمبرر ',
                'description' => 'يُمنع الغياب عن المدرسةإلا بوجود مبرر يقوم الأهل بتقديمه. العياب لأكثر من 7 مرات بدون عذر مقبول خلال الفصل الواحد يعرض الطالب لإجراءات إدارية قد تصل إلى الفصل.',
            ],
            [
                'title' => 'منع اصطحاب الهواتف المحمولة',
                'description' => 'يُمنع منعاً باتاً إحضار الهواتف المحمولة أو الأجهزة الإلكترونية الذكية إلى الحرم المدرسي. وفي حال المخالفة، تتم مصادرة الجهاز واستدعاء ولي الأمر.',
            ],
            [
                'title' => 'الالتزام بالزي المدرسي',
                'description' => 'يجب على جميع الطلاب الالتزام التام بارتداء الزي المدرسي الرسمي والنظيف يومياً. المخالفة المتكررة تستوجب توجيه إنذار ثم عقوبة انضباطية.',
            ],
            [
                'title' => 'الالتزام بمواعيد الدوام المدرسي',
                'description' => 'يُمنع التأخر عن طابور الصباح أو الحصص الدراسية. التأخر لأكثر من 3 مرات بدون عذر مقبول يعرض الطالب لإجراءات إدارية.',
            ],
            [
                'title' => 'احترام الكادر التدريسي والإداري',
                'description' => 'يجب التعامل باحترام وتقدير مع جميع المعلمين والإداريين. أي تطاول لفظي أو جسدي يُعرض الطالب للفصل المباشر.',
            ],
            [
                'title' => 'المحافظة على الممتلكات العامة',
                'description' => 'يُمنع العبث أو تخريب ممتلكات المدرسة (المقاعد، الجدران، المختبرات). يلتزم ولي أمر الطالب بدفع قيمة الأضرار المادية بالإضافة للعقوبة المسلكية.',
            ],
            [
                'title' => 'منع الشجار والعنف',
                'description' => 'يُحظر تماماً افتعال الشجارات أو ممارسة التنمر أو العنف اللفظي والجسدي ضد زملاء الدراسة داخل الحرم المدرسي أو في محيطه.',
            ],
            [
                'title' => 'الالتزام بالنزاهة الأكاديمية (منع الغش)',
                'description' => 'أي محاولة للغش في المذاكرات أو الامتحانات النهائية تؤدي إلى رسوب الطالب في المادة وتوجيه إنذار رسمي يوضع في ملفه.',
            ]
        ];

        foreach ($laws as $law) {
            SchoolLaw::updateOrCreate($law);
        }
    }
}
